<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

use Spatie\Permission\Models\Role;
use Spatie\Permission\Models\Permission;

class RolePermissionSeeder extends Seeder
{
    public function run(): void
    {
        $permissions = [
            'المستخدمين.ادارة',
            'المستخدمين.عرض',

            'المدارس.ادارة',
            'المدارس.عرض',

            'المستويات.ادارة',
            'المستويات.عرض',

            'المواد.ادارة',
            'المواد.عرض',

            'الصفوف.ادارة',
            'الصفوف.عرض',

            'الدرجات.ادارة',
            'الدرجات.عرض',
            'الدرجات.انشاء',
            'الدرجات.تحديث',
            'الدرجات.حذف',
            'الدرجات.توليد_تقارير',

            'التحويلات_القبول.ادارة',
            'التحويلات_القبول.عرض',
            'التحويلات_القبول.انشاء',
            'التحويلات_القبول.تحديث',
            'التحويلات_القبول.حذف',
            'التحويلات_القبول.استيراد',
            'التحويلات_القبول.تصدير',
            'التحويلات_القبول.توليد_تقارير',

            'بدل_فاقد.ادارة',
            'بدل_فاقد.عرض',
            'بدل_فاقد.انشاء',
            'بدل_فاقد.تحديث',
            'بدل_فاقد.حذف',
            'بدل_فاقد.توليد_تقارير',

            'الطلاب.ادارة',
            'الطلاب.عرض',
            'الطلاب.انشاء',
            'الطلاب.تحديث',
            'الطلاب.حذف',
            'الطلاب.استيراد',
            'الطلاب.تصدير',
            'الطلاب.توليد_تقارير',

            'النتائج.ادارة',
            'النتائج.عرض',
            'النتائج.انشاء',
            'النتائج.تحديث',
            'النتائج.حذف',
            'النتائج.استيراد',
            'النتائج.تصدير',
            'النتائج.توليد_تقارير',

            'الادوار.ادارة',

            'السنة_الدراسية.ادارة',
            'السنة_الدراسية.عرض',

            'الاخطاء.ادارة',
            'الاخطاء.عرض',
            'الاخطاء.انشاء',
            'الاخطاء.تحديث',
            'الاخطاء.حذف',
            'الاخطاء.استيراد',
            'الاخطاء.تصدير',
            'الاخطاء.توليد_تقارير',

            'الطلاب_الموقوفين.عرض',
            'الطلاب_الموقوفين.تفعيل'

        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(['name' => $permission,'guard_name' => 'sanctum']);
        }

        $admin = Role::firstOrCreate(['name' => 'admin','guard_name' => 'sanctum']);

        $admin->givePermissionTo(Permission::all());
    }
}