<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

use Spatie\Permission\Models\Role;
use Spatie\Permission\Models\Permission;

class RolePermissionSeeder extends Seeder
{
    public function run(): void
    {
        $permissions = [
            'المستخدمين.أدارة',
            'المستخدمين.عرض',

            'المدارس.أدارة',
            'المدارس.عرض',

            'المستويات.أدارة',
            'المستويات.عرض',

            'المواد.أدارة',
            'المواد.عرض',

            'الفصول.أدارة',
            'الفصول.عرض',

            'الدرجات.أدارة',
            'الدرجات.عرض',
            'الدرجات.انشاء',
            'الدرجات.تحديث',
            'الدرجات.حدف',
            'الدرجات.توليد_تقارير',

            'التحويلات_القبول.أدارة',
            'التحويلات_القبول.عرض',
            'التحويلات_القبول.انشاء',
            'التحويلات_القبول.تحديث',
            'التحويلات_القبول.حدف',
            'التحويلات_القبول.استيراد',
            'التحويلات_القبول.تصدير',
            'التحويلات_القبول.توليد_تقارير',

            'التحويلات_الرفض.أدارة',
            'بدل_فاقد.عرض',
            'بدل_فاقد.انشاء',
            'بدل_فاقد.حدف',

            'الطلاب.أدارة',
            'الطلاب.عرض',
            'الطلاب.انشاء',
            'الطلاب.تحديث',
            'الطلاب.حدف',
            'الطلاب.استيراد',
            'الطلاب.تصدير',
            'الطلاب.توليد_تقارير',

            'النتائج.أدارة',
            'النتائج.عرض',
            'النتائج.انشاء',
            'النتائج.تحديث',
            'النتائج.حدف',
            'النتائج.استيراد',
            'النتائج.تصدير',
            'النتائج.توليد_تقارير'

        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(['name' => $permission]);
        }

        $admin = Role::firstOrCreate(['name' => 'admin']);

        $admin->givePermissionTo(Permission::all());
    }
}
